In [17]:
import pandas as pd

In [31]:
data ={"a" :[1,2,3,4],
       "b" :[7,8,9,5],
       "c" :["shudh","kumar","sing","kharwar"]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

   a  b        c
0  1  7    shudh
1  2  8    kumar
2  3  9     sing
3  4  5  kharwar

In [34]:
#this function set col (index row)  
df.set_index("a",inplace=True)

In [35]:
df

   b        c
a
1  7    shudh
2  8    kumar
3  9     sing
4  5  kharwar

In [36]:
# this function reset index but not permanent 
df.reset_index()

   a  b        c
0  1  7    shudh
1  2  8    kumar
2  3  9     sing
3  4  5  kharwar

In [37]:
df

   b        c
a
1  7    shudh
2  8    kumar
3  9     sing
4  5  kharwar

In [40]:
#this function re- Assing agian then permannetn change index 
df = df.reset_index()

In [41]:
df

   level_0  index  a  b        c
0        0      0  1  7    shudh
1        1      1  2  8    kumar
2        2      2  3  9     sing
3        3      3  4  5  kharwar

In [43]:
# this function passing index by defult set all index 
data ={"a" :[1,2,3,4],
       "b" :[7,8,9,5],
       "c" :["shudh","kumar","sing","kharwar"]}
df1=pd.DataFrame(data,index=['a','b','c','d'])

In [45]:
df1

   a  b        c
a  1  7    shudh
b  2  8    kumar
c  3  9     sing
d  4  5  kharwar

In [48]:
df1.reindex(['b','c','a'])

   a  b      c
b  2  8  kumar
c  3  9   sing
a  1  7  shudh